// botCommands/utils/isMod.js
function normalizeString(stringValue) {
    const transliterationMap = {
        'а': 'a', 'А': 'A', 'е': 'e', 'Е': 'E', 'о': 'o', 'О': 'O', 'р': 'p', 'Р': 'P',
        'с': 'c', 'С': 'C', 'у': 'y', 'У': 'Y', 'х': 'x', 'Х': 'X', 'В': 'B', 'Ь': 'b',
        'К': 'K', 'М': 'M', 'Н': 'H', 'Т': 'T', 'І': 'I', 'і': 'i', 'Ь': 'b', 'Ј': 'J',
        'Ԍ': 'G', 'Ӏ': 'I', 'Α': 'A', 'Β': 'B', 'Ε': 'E', 'Ζ': 'Z', 'Η': 'H', 'Ι': 'I',
        'Κ': 'K', 'Μ': 'M', 'Ν': 'N', 'Ο': 'O', 'ο': 'o', 'Ρ': 'P', 'Τ': 'T', 'Υ': 'Y',
        'Χ': 'X', 'Ϲ': 'C', 'ʏ': 'y', 'ʙ': 'B', 'ʜ': 'H', 'ʀ': 'R', 'ɡ': 'g', '𝖠': 'A',
        '𝗔': 'A', '𝘼': 'A', '𝖡': 'B', '𝗕': 'B', '𝘉': 'B', '𝘽': 'B', '𝖢': 'C', '𝗖': 'C',
        '𝘊': 'C', '𝘾': 'C', '𝖣': 'D', '𝗗': 'D', '𝘋': 'D', '𝘿': 'D', '𝖤': 'E', '𝗘': 'E',
        '𝘌': 'E', '𝙀': 'E', '𝖥': 'F', '𝗙': 'F', '𝘍': 'F', '𝙁': 'F', '𝖢': 'G', '𝗚': 'G',
        '𝘎': 'G', '𝙂': 'G', '𝖧': 'H', '𝗛': 'H', '𝘏': 'H', '𝙃': 'H', '𝖨': 'I', '𝗜': 'I',
        '𝘐': 'I', '𝙄': 'I', '𝖩': 'J', '𝗝': 'J', '𝘑': 'J', '𝙅': 'J', '𝖪': 'K', '𝗞': 'K',
        '𝘒': 'K', '𝙆': 'K', '𝖫': 'L', '𝗟': 'L', '𝘓': 'L', '𝙇': 'L', '𝖬': 'M', '𝗠': 'M',
        '𝘔': 'M', '𝙈': 'M', '𝖭': 'N', '𝗡': 'N', '𝘕': 'N', '𝙉': 'N', '𝖮': 'O', '𝗢': 'O',
        '𝘖': 'O', '𝙊': 'O', '𝖯': 'P', '𝗣': 'P', '𝘗': 'P', '𝙋': 'P', '𝖰': 'Q', '𝗤': 'Q',
        '𝘘': 'Q', '𝙌': 'Q', '𝖱': 'R', '𝗥': 'R', '𝘙': 'R', '𝙍': 'R', '𝖲': 'S', '𝗦': 'S',
        '𝘚': 'S', '𝙎': 'S', '𝖳': 'T', '𝗧': 'T', '𝘛': 'T', '𝙏': 'T', '𝖴': 'U', '𝗨': 'U',
        '𝘜': 'U', '𝙐': 'U', '𝖵': 'V', '𝗩': 'V', '𝘝': 'V', '𝙑': 'V', '𝖶': 'W', '𝗪': 'W',
        '𝘞': 'W', '𝙒': 'W', '𝖷': 'X', '𝗫': 'X', '𝘟': 'X', '𝙓': 'X', '𝖸': 'Y', '𝗬': 'Y',
        '𝘠': 'Y', '𝙔': 'Y', '𝖹': 'Z', '𝗭': 'Z', '𝘡': 'Z', '𝙕': 'Z', 'ㅤ': ' ',
    };
    stringValue = stringValue.replace(/[\u200B-\u200D\uFEFF]/g, '');
    return [...stringValue].map(char => transliterationMap[char] || char).join('');
}
module.exports = normalizeString;